/**
 *
 * 如下列数，第一项是1/1，第二项是1/2，第三项是2/1，第四项是3/1，第五项是2/2，……。输入n。输出第n项。
 * 1/1 1/2 1/3 1/4 1/5
 * 2/1 2/2 2/3 2/4
 * 3/1 3/2 3/3
 * 4/1 4/2
 * 5/1
 *
 * 输入样例：
 * 3
 * 14
 * 7
 * 12345
 * 输出样例：
 * 2/1
 * 2/4
 * 1/4
 * 59/99
 *
 */
#include <iostream>

using namespace std;

int main() {
    long i = 0, n;
    while (cin >> n) {
        i = 0;
        while (i < n) {
            // 每斜线个数为i
            n -= i;
            // 下一斜线
            i++;
        }
        // 此时为第 i 斜线上第 n 个数，分子+分母 = i+1
        if ((int) (i & 1) == 0) {
            // 偶数斜线 分子从上往下
            cout << n << "/" << i + 1 - n << endl;
        } else {
            // 奇数斜线 分母从下往上
            cout << i + 1 - n << "/" << n << endl;/**/
        }
    }
    return 0;
}